#基于元组的解包进行
"""根据如下提供的学生成绩单，完成如下需求:
1.计算每个学生的总分、各科平均分，然后一并输出出来。
2.统计各科成绩的最低分、最高分、平均分，并输出。
3.查找成绩优秀(平均分大于90)的学生，并输出。
"""

# 学生成绩单测试数据 (元组列表：学号, 姓名, 语文, 数学, 英语)
students = [
    ("S001", "王林", 85, 92, 78),
    ("S002", "李慕婉", 92, 88, 95),
    ("S003", "十三", 78, 85, 82),
    ("S004", "曾牛", 88, 79, 91),
    ("S005", "周铁", 95, 96, 89),
    ("S006", "王卓", 76, 82, 77),
    ("S007", "红蝶", 89, 91, 94),
    ("S008", "徐立国", 75, 69, 82),
    ("S009", "许木", 86, 89, 98),
    ("S010", "遁天", 66, 59, 72)
]
print("学号\t\t姓名\t\t语文\t\t数学\t\t英语\t\t总分\t\t平均分")
#解包操作
for id,name,chinese, math, english in students:
    total= chinese+math+english
    avg= total/3
    print(f"{id}\t\t{name}\t\t{chinese}\t\t\t{math}\t\t\t{english}\t\t\t{total}\t\t\t{avg:.2f}")
